In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('Data/Index_col.csv', sep=';', index_col=['Entreprise', 'Année'])
data

                  Ventes   Profits
Entreprise Année
Apple      2020       100       40
           2021       142      213
Microsoft  2020       500       59
           2021       230        8

In [3]:
data2 = pd.read_csv('Data/Index_col.csv', sep=';')
print(data2)

  Entreprise  Année  Ventes   Profits
0      Apple   2020      100       40
1      Apple   2021      142      213
2  Microsoft   2020      500       59
3  Microsoft   2021      230        8

In [4]:
print("Unique indexing:", data2.index.is_unique)
company_id = data2.Entreprise
data3 = data.copy()
data3.index = company_id
print(data3)
print("Unique indexing:", data3.index.is_unique)

Unique indexing: True
            Ventes   Profits
Entreprise
Apple           100       40
Apple           142      213
Microsoft       500       59
Microsoft       230        8
Unique indexing: False

In [5]:
unique_id = data2.Entreprise + data2.Année.astype(str)
data3.index = unique_id
print(data3)

               Ventes   Profits
Apple2020          100       40
Apple2021          142      213
Microsoft2020      500       59
Microsoft2021      230        8

In [6]:
data3.loc['Apple2020']

Ventes     100
Profits     40
Name: Apple2020, dtype: int64

In [7]:
x = data2.query('Année == 2020').copy()
x

  Entreprise  Année  Ventes   Profits
0      Apple   2020      100       40
2  Microsoft   2020      500       59

In [8]:
mb = pd.read_csv("Data/microbiome_missing.csv", na_values=['?', -99999], nrows=20)
mb['year'] = 2013
mb['treatment'] = None

mb.loc[(0, 'year')] = None
mb.loc[(0,'treatment')] = 1000
mb

             Taxon  Patient   Tissue   Stool    year treatment
0       Firmicutes        1    632.0   305.0     NaN      1000
1       Firmicutes        2    136.0  4182.0  2013.0      None
2       Firmicutes        3      NaN   703.0  2013.0      None
3       Firmicutes        4    408.0  3946.0  2013.0      None
4       Firmicutes        5    831.0  8605.0  2013.0      None
5       Firmicutes        6    693.0    50.0  2013.0      None
6       Firmicutes        7    718.0   717.0  2013.0      None
7       Firmicutes        8    173.0    33.0  2013.0      None
8       Firmicutes        9    228.0     NaN  2013.0      None
9       Firmicutes       10    162.0  3196.0  2013.0      None
10      Firmicutes       11    372.0     NaN  2013.0      None
11      Firmicutes       12   4255.0  4361.0  2013.0      None
12      Firmicutes       13    107.0  1667.0  2013.0      None
13      Firmicutes       14      NaN   223.0  2013.0      None
14      Firmicutes       15    281.0  2377.0  2013.0      None
15  Proteobacteria        1   1638.0  3886.0  2013.0      None
16  Proteobacteria        2   2469.0  1821.0  2013.0      None
17  Proteobacteria        3    839.0   661.0  2013.0      None
18  Proteobacteria        4   4414.0    18.0  2013.0      None
19  Proteobacteria        5  12044.0    83.0  2013.0      None

In [9]:
mb.dropna()

Empty DataFrame
Columns: [Taxon, Patient, Tissue, Stool, year, treatment]
Index: []

In [10]:
mb.fillna({'year': 2013, 'treatment': 2})

C:\Users\celin\AppData\Local\Temp\ipykernel_11512\1716032382.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  mb.fillna({'year': 2013, 'treatment': 2})

             Taxon  Patient   Tissue   Stool    year  treatment
0       Firmicutes        1    632.0   305.0  2013.0       1000
1       Firmicutes        2    136.0  4182.0  2013.0          2
2       Firmicutes        3      NaN   703.0  2013.0          2
3       Firmicutes        4    408.0  3946.0  2013.0          2
4       Firmicutes        5    831.0  8605.0  2013.0          2
5       Firmicutes        6    693.0    50.0  2013.0          2
6       Firmicutes        7    718.0   717.0  2013.0          2
7       Firmicutes        8    173.0    33.0  2013.0          2
8       Firmicutes        9    228.0     NaN  2013.0          2
9       Firmicutes       10    162.0  3196.0  2013.0          2
10      Firmicutes       11    372.0     NaN  2013.0          2
11      Firmicutes       12   4255.0  4361.0  2013.0          2
12      Firmicutes       13    107.0  1667.0  2013.0          2
13      Firmicutes       14      NaN   223.0  2013.0          2
14      Firmicutes       15    281.0  2377.0  2013.0          2
15  Proteobacteria        1   1638.0  3886.0  2013.0          2
16  Proteobacteria        2   2469.0  1821.0  2013.0          2
17  Proteobacteria        3    839.0   661.0  2013.0          2
18  Proteobacteria        4   4414.0    18.0  2013.0          2
19  Proteobacteria        5  12044.0    83.0  2013.0          2

In [11]:
mb = pd.read_csv("Data/microbiome.csv", index_col=['Taxon', 'Patient'])
mb

                    Group  Tissue  Stool
Taxon      Patient
Firmicutes 1            0     136   4182
           2            1    1174    703
           3            0     408   3946
           4            1     831   8605
           5            0     693     50
...                   ...     ...    ...
Other      10           1     203      6
           11           0     392      6
           12           1      28     25
           13           0      12     22
           14           1     305     32

[70 rows x 3 columns]

In [12]:
baseball = pd.read_csv("Data/baseball.csv")
baseball2007 = baseball.query('year == 2007')
baseball2007[baseball2007.team.isin(['LAN', 'SFN'])]

baseball_sorted = baseball.query('year == 2007 and team in ["LAN", "SFN"]')
baseball_sorted

,id,player,year,stint,team,lg,g,ab,r,h,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
17,89339,wellsda01,2007,2,LAN,NL,7,15,2,4,...,1.0,0.0,0.0,0,6.0,0.0,0.0,0.0,0.0,0.0
22,89347,vizquom01,2007,1,SFN,NL,145,513,54,126,...,51.0,14.0,6.0,44,48.0,6.0,1.0,14.0,3.0,14.0
31,89365,sweenma01,2007,2,LAN,NL,30,33,2,9,...,3.0,0.0,0.0,1,11.0,0.0,0.0,0.0,0.0,0.0
32,89366,sweenma01,2007,1,SFN,NL,76,90,18,23,...,10.0,2.0,0.0,13,18.0,0.0,3.0,1.0,0.0,0.0
42,89382,seaneru01,2007,1,LAN,NL,68,1,0,0,...,0.0,0.0,0.0,0,1.0,0.0,0.0,0.0,0.0,0.0
43,89383,schmija01,2007,1,LAN,NL,6,7,1,1,...,1.0,0.0,0.0,0,4.0,0.0,0.0,1.0,0.0,0.0
62,89431,loaizes01,2007,1,LAN,NL,5,7,0,1,...,2.0,0.0,0.0,0,2.0,0.0,0.0,2.0,0.0,1.0
63,89438,kleskry01,2007,1,SFN,NL,116,362,51,94,...,44.0,5.0,1.0,46,68.0,2.0,1.0,1.0,1.0,14.0
64,89439,kentje01,2007,1,LAN,NL,136,494,78,149,...,79.0,1.0,3.0,57,61.0,4.0,5.0,0.0,6.0,17.0
68,89451,hernaro01,2007,2,LAN,NL,22,0,0,0,...,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0
75,89466,gonzalu01,2007,1,LAN,NL,139,464,70,129,...,68.0,6.0,2.0,56,56.0,4.0,4.0,0.0,2.0,11.0
93,89521,bondsba01,2007,1,SFN,NL,126,340,75,94,...,66.0,5.0,0.0,132,54.0,43.0,3.0,0.0,2.0,13.0
96,89526,benitar01,2007,1,SFN,NL,19,0,0,0,...,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0

In [13]:
premier_league = pd.read_csv("Data/premier_league.csv", sep=';')
premier_league

   year       team   player      post  ranking  goals  Unnamed: 6
0  2006  Liverpool   Torres  Attacker        1     23         NaN
1  2006  Liverpool   Gerard       Mid        1     19         NaN
2  2006    Chelsea  Drogba   Attacker        2      5         NaN
3  2006    Chelsea   Anelka  Attacker        2     32         NaN
4  2007  Liverpool   Torres  Attacker        4     12         NaN
5  2007  Liverpool   Gerard       Mid        4     19         NaN
6  2007    Chelsea  Drogba   Attacker        5      3         NaN
7  2007    Chelsea  Lampard  Attacker        5      9         NaN

In [14]:
goals2006 = premier_league.query('year == 2006').goals
goals2007 = premier_league.query('year == 2007').goals

goals2006.index = premier_league.query('year == 2006').player
goals2007.index = premier_league.query('year == 2007').player

sum = goals2006.add(goals2007, fill_value=0)
print(f"2006:\n {goals2006}\n\n2007:\n {goals2007}\n\n2006 + 2007:\n {sum}")

prod = goals2006.mul(goals2007, fill_value=0)
print(f"\n2006 * 2007:\n {prod}")

2006:
 player
Torres     23
Gerard     19
Drogba      5
Anelka     32
Name: goals, dtype: int64

2007:
 player
Torres     12
Gerard     19
Drogba      3
Lampard     9
Name: goals, dtype: int64

2006 + 2007:
 player
Anelka     32.0
Drogba      8.0
Gerard     38.0
Lampard     9.0
Torres     35.0
Name: goals, dtype: float64

2006 * 2007:
 player
Anelka       0.0
Drogba      15.0
Gerard     361.0
Lampard      0.0
Torres     276.0
Name: goals, dtype: float64

In [15]:
premier_league.goals / max(premier_league.goals)

0    0.71875
1    0.59375
2    0.15625
3    1.00000
4    0.37500
5    0.59375
6    0.09375
7    0.28125
Name: goals, dtype: float64

In [16]:
premier_league['goals'].sort_values(ascending=False)

3    32
0    23
1    19
5    19
4    12
7     9
2     5
6     3
Name: goals, dtype: int64

In [17]:
premier_league.sort_values(by=['year', 'goals'], ascending=[True, False])

   year       team   player      post  ranking  goals  Unnamed: 6
3  2006    Chelsea   Anelka  Attacker        2     32         NaN
0  2006  Liverpool   Torres  Attacker        1     23         NaN
1  2006  Liverpool   Gerard       Mid        1     19         NaN
2  2006    Chelsea  Drogba   Attacker        2      5         NaN
5  2007  Liverpool   Gerard       Mid        4     19         NaN
4  2007  Liverpool   Torres  Attacker        4     12         NaN
7  2007    Chelsea  Lampard  Attacker        5      9         NaN
6  2007    Chelsea  Drogba   Attacker        5      3         NaN

In [18]:
premier_league['year'].cov(premier_league['goals'])

-2.571428571428571

In [19]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])
print(frame, "\n")
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
print(frame, "\n")
frame.columns = frame.columns.swaplevel('state', 'color')
print(frame)

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

color     Green  Red    Green
state      Ohio Ohio Colorado
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11